hjjLeon/FDogs/H7Test.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=48000000
ProjectManager.MainLocation=Src
VP_TIM5_VS_ClockSourceINT.Mode=Internal
FREERTOS.Queues01=portRawDataRx,2048,uint8_t,0,Static,portRawDataRxBuffer,portRawDataRxControlBlock;cmdPacketRx,16,64,1,Static,cmdPacketRxBuffer,cmdPacketRxControlBlock;cmdPacketTx,16,64,1,Static,cmdPacketTxBuffer,cmdPacketTxControlBlock;portRawDataTx,2048,uint8_t,0,Static,portRawDataTxBuffer,portRawDataTxControlBlock;cmdPacketRxInstant,16,64,1,Static,cmdPacketRxInstantBuffer,cmdPacketRxInstantControlBlock
SH.S_TIM4_CH2.ConfNb=1
USB_DEVICE.CLASS_NAME_FS=CDC
VP_SYS_VS_tim6.Mode=TIM6
SPI2.VirtualNSS=VM_NSSHARD
RCC.SAI1Freq_Value=480000000
RCC.CortexFreq_Value=480000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H750VBTx
SPI2.VirtualType=VM_MASTER
PB10.Mode=Single Bank 1
RCC.HPRE=RCC_HCLK_DIV2
VP_TIM5_VS_ClockSourceINT.Signal=TIM5_VS_ClockSourceINT
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_TIM2_Init-TIM2-false-HAL-true,4-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false,5-MX_CRC_Init-CRC-false-HAL-true,6-MX_SPI2_Init-SPI2-false-HAL-true,7-MX_TIM3_Init-TIM3-false-HAL-true,8-MX_TIM4_Init-TIM4-false-HAL-true,9-MX_TIM5_Init-TIM5-false-HAL-true,10-MX_QUADSPI_Init-QUADSPI-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PA11.Mode=Device_Only
RCC.RTCFreq_Value=32000
USB_DEVICE.VirtualMode-CDC_FS=Cdc
RCC.CpuClockFreq_Value=480000000
RCC.VCO2OutputFreq_Value=96000000
TIM5.OCPolarity_3=TIM_OCPOLARITY_LOW
TIM5.OCPolarity_4=TIM_OCPOLARITY_LOW
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PC1.Locked=true
PB11.Signal=S_TIM2_CH4
PB13.Signal=SPI2_SCK
PB15.Signal=SPI2_MOSI
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x800
TIM5.OCPolarity_1=TIM_OCPOLARITY_LOW
RCC.AHB4Freq_Value=240000000
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
RCC.VCOInput3Freq_Value=8000000
RCC.LPTIM1Freq_Value=120000000
PD13.Signal=S_TIM4_CH2
Mcu.IP4=NVIC
Mcu.IP5=QUADSPI
Mcu.IP2=DEBUG
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
Mcu.IP3=FREERTOS
Mcu.IP0=CORTEX_M7
PA14\ (JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
Mcu.IP1=CRC
PA12.Signal=USB_OTG_FS_DP
SPI2.CLKPolarity=SPI_POLARITY_HIGH
Mcu.UserConstants=
SH.S_TIM3_CH2.ConfNb=1
RCC.DIVP3Freq_Value=480000000
RCC.SDMMCFreq_Value=480000000
NVIC.TIM5_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=240000000
RCC.I2C4Freq_Value=120000000
PE2.Mode=Single Bank 1
Mcu.IPNb=15
TIM2.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Prescaler,Period,AutoReloadPreload,Pulse-PWM Generation1 CH1,Pulse-PWM Generation2 CH2,Channel-PWM Generation4 CH4,OCPolarity_1,OCPolarity_2,OCPolarity_4
ProjectManager.PreviousToolchain=
TIM3.Period=44443
PB6.Signal=S_TIM4_CH1
RCC.SPDIFRXFreq_Value=480000000
SH.S_TIM5_CH3.0=TIM5_CH3,PWM Generation3 CH3
RCC.DIVQ3Freq_Value=48000000
Mcu.Pin6=PC2_C
Mcu.Pin7=PA0
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PA1
Mcu.Pin9=PA2
FREERTOS.IPParameters=Tasks01,Queues01,FootprintOK,configUSE_IDLE_HOOK,Mutexes01
PC2_C.Signal=GPIO_Output
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_8
PB13.Locked=true
Mcu.Pin0=PE2
Mcu.Pin1=PC13
TIM3.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Mcu.Pin2=PH0-OSC_IN (PH0)
RCC.HRTIMFreq_Value=240000000
Mcu.Pin3=PH1-OSC_OUT (PH1)
Mcu.Pin4=PC0
Mcu.Pin5=PC1
ProjectManager.ProjectBuild=false
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
RCC.DIVR3Freq_Value=480000000
RCC.HSE_VALUE=8000000
TIM4.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PB2.Signal=QUADSPI_CLK
PA4.Locked=true
RCC.DIVM3=1
Mcu.IP10=TIM3
RCC.DIVM2=10
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
RCC.DIVM1=1
Mcu.IP12=TIM5
Mcu.IP11=TIM4
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.5.0
MxDb.Version=DB.5.0.60
RCC.DIVP1Freq_Value=480000000
Mcu.IP14=USB_OTG_FS
Mcu.IP13=USB_DEVICE
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=240000000
TIM5.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PB14.Mode=Full_Duplex_Master
TIM3.Prescaler=26
NVIC.TIM2_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.USART16Freq_Value=120000000
File.Version=6
PC13.GPIO_PuPd=GPIO_PULLUP
SPI2.CalculateBaudRate=60.0 MBits/s
SH.S_TIM4_CH2.0=TIM4_CH2,PWM Generation2 CH2
PE2.Signal=QUADSPI_BK1_IO2
SH.S_TIM2_CH1.ConfNb=1
PA14\ (JTCK/SWCLK).Mode=Serial_Wire
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
SH.S_TIM3_CH1.0=TIM3_CH1,PWM Generation1 CH1
TIM4.Period=44443
RCC.DIVR2Freq_Value=48000000
ProjectManager.HalAssertFull=true
RCC.DIVP2Freq_Value=48000000
PC2_C.Locked=true
ProjectManager.ProjectName=H7Test
PA0.Signal=S_TIM5_CH1
RCC.APB3Freq_Value=120000000
TIM3.OCPolarity_1=TIM_OCPOLARITY_LOW
TIM3.OCPolarity_2=TIM_OCPOLARITY_LOW
TIM3.OCPolarity_3=TIM_OCPOLARITY_LOW
RCC.MCO2PinFreq_Value=480000000
Mcu.Package=LQFP100
TIM2.Prescaler=26
PA6.Signal=S_TIM3_CH1
PB12.Mode=NSS_Signal_Hard_Output
NVIC.TimeBase=TIM6_DAC_IRQn
SPI2.Mode=SPI_MODE_MASTER
PD11.Locked=true
RCC.D1PPRE=RCC_APB3_DIV2
PD12.Signal=QUADSPI_BK1_IO1
NVIC.OTG_FS_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
ProjectManager.ToolChainLocation=
NVIC.TimeBaseIP=TIM6
FREERTOS.FootprintOK=true
USB_OTG_FS.VirtualMode=Device_Only
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
RCC.DFSDMFreq_Value=120000000
RCC.DIVR1Freq_Value=480000000
SPI2.CLKPhase=SPI_PHASE_2EDGE
TIM2.Pulse-PWM\ Generation2\ CH2=1347
RCC.TraceFreq_Value=480000000
SH.S_TIM4_CH1.0=TIM4_CH1,PWM Generation1 CH1
RCC.APB4Freq_Value=120000000
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=480000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SH.S_TIM5_CH1.0=TIM5_CH1,PWM Generation1 CH1
RCC.LPUART1Freq_Value=120000000
SPI2.Direction=SPI_DIRECTION_2LINES
USB_OTG_FS.IPParameters=VirtualMode
PB13.Mode=Full_Duplex_Master
SH.S_TIM2_CH4.ConfNb=1
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
RCC.Tim2OutputFreq_Value=240000000
RCC.DFSDMACLkFreq_Value=480000000
PB15.Locked=true
RCC.VCO3OutputFreq_Value=960000000
PA3.Signal=S_TIM5_CH4
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
TIM4.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
SH.S_TIM4_CH1.ConfNb=1
ProjectManager.ProjectFileName=H7Test.ioc
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
RCC.DIVQ3=20
SH.S_TIM2_CH1.0=TIM2_CH1,PWM Generation1 CH1
FREERTOS.Tasks01=commandTask,24,256,StartCommandTask,Default,NULL,Dynamic,NULL,NULL;AlgsTask,48,512,StartAlgsTask,Default,NULL,Dynamic,NULL,NULL;RawSendTask,40,512,StartRawSendTask,Default,NULL,Dynamic,NULL,NULL
TIM5.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Prescaler,Period,OCPolarity_1,OCPolarity_3,OCPolarity_4
PA13\ (JTMS/SWDIO).Mode=Serial_Wire
Mcu.PinsNb=41
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Cdc_FS
PC13.Locked=true
PC13.Signal=GPIO_Input
RCC.SWPMI1Freq_Value=120000000
RCC.SAI4BFreq_Value=480000000
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
TIM5.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
PB12.Locked=true
ProjectManager.DeletePrevious=true
TIM2.OCPolarity_4=TIM_OCPOLARITY_LOW
PC0.Signal=GPIO_Output
PB14.Locked=true
TIM2.OCPolarity_1=TIM_OCPOLARITY_LOW
PB10.Locked=true
TIM2.OCPolarity_2=TIM_OCPOLARITY_LOW
RCC.QSPIFreq_Value=240000000
SH.S_TIM3_CH3.0=TIM3_CH3,PWM Generation3 CH3
USB_DEVICE.IPParameters=VirtualMode-CDC_FS,VirtualModeFS,CLASS_NAME_FS
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
CRC.IPParameters=DefaultPolynomialUse,CRCLength,DefaultInitValueUse
TIM2.Pulse-PWM\ Generation1\ CH1=1347
PD12.Locked=true
RCC.SPI6Freq_Value=120000000
RCC.D1CPREFreq_Value=480000000
FREERTOS.configUSE_IDLE_HOOK=1
TIM3.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
CRC.DefaultPolynomialUse=DEFAULT_POLYNOMIAL_DISABLE
RCC.USART234578Freq_Value=120000000
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
RCC.SPI45Freq_Value=120000000
RCC.Tim1OutputFreq_Value=240000000
RCC.SPI123Freq_Value=480000000
PB3\ (JTDO/TRACESWO).Signal=S_TIM2_CH2
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
ProjectManager.TargetToolchain=MDK-ARM V5
TIM4.IPParameters=Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Channel-PWM Generation1 CH1,Prescaler,Period,OCPolarity_1,OCPolarity_2,OCPolarity_3
RCC.VCO1OutputFreq_Value=960000000
SH.S_TIM3_CH3.ConfNb=1
SPI2.CRCCalculation=SPI_CRCCALCULATION_DISABLE
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
SH.S_TIM4_CH3.0=TIM4_CH3,PWM Generation3 CH3
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
RCC.DIVN3=120
SH.S_TIM2_CH2.ConfNb=1
RCC.AXIClockFreq_Value=240000000
RCC.DIVN2=120
RCC.DIVN1=120
SH.S_TIM5_CH3.ConfNb=1
SPI2.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate,DataSize,CLKPolarity,CLKPhase,CRCCalculation,VirtualNSS
RCC.USBFreq_Value=48000000
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
TIM4.Prescaler=26
PA1.Signal=QUADSPI_BK1_IO3
RCC.CKPERFreq_Value=64000000
PB10.Signal=QUADSPI_BK1_NCS
SH.S_TIM4_CH3.ConfNb=1
PB14.Signal=SPI2_MISO
RCC.USBCLockSelection=RCC_USBCLKSOURCE_PLL3
PA5.Signal=S_TIM2_CH1
Mcu.Pin40=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
SH.S_TIM3_CH2.0=TIM3_CH2,PWM Generation2 CH2
board=custom
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
NVIC.TIM3_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.VCOInput1Freq_Value=8000000
TIM4.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
VP_SYS_VS_tim6.Signal=SYS_VS_tim6
RCC.AHB12Freq_Value=240000000
RCC.APB2Freq_Value=120000000
PA1.Mode=Single Bank 1
MxCube.Version=5.6.1
Mcu.Pin37=VP_TIM3_VS_ClockSourceINT
Mcu.Pin38=VP_TIM4_VS_ClockSourceINT
Mcu.Pin35=VP_SYS_VS_tim6
VP_TIM2_VS_ClockSourceINT.Mode=Internal
Mcu.Pin36=VP_TIM2_VS_ClockSourceINT
PC13.GPIOParameters=GPIO_PuPd
RCC.FDCANFreq_Value=480000000
Mcu.Pin39=VP_TIM5_VS_ClockSourceINT
RCC.RNGFreq_Value=48000000
Mcu.Pin30=PA14 (JTCK/SWCLK)
RCC.ADCFreq_Value=48000000
Mcu.Pin33=VP_CRC_VS_CRC
TIM3.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Prescaler,Period,OCPolarity_1,OCPolarity_2,OCPolarity_3
Mcu.Pin34=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin31=PB3 (JTDO/TRACESWO)
Mcu.Pin32=PB6
SH.S_TIM5_CH4.0=TIM5_CH4,PWM Generation4 CH4
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SH.S_TIM5_CH4.ConfNb=1
TIM2.Period=44443
ProjectManager.FreePins=true
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H750VBTx
RCC.LPTIM2Freq_Value=120000000
Mcu.Pin26=PD14
TIM4.OCPolarity_3=TIM_OCPOLARITY_LOW
Mcu.Pin27=PA11
PA2.Signal=S_TIM5_CH3
Mcu.Pin24=PD12
TIM4.OCPolarity_1=TIM_OCPOLARITY_LOW
ProjectManager.UnderRoot=false
Mcu.Pin25=PD13
TIM4.OCPolarity_2=TIM_OCPOLARITY_LOW
PB2.Locked=true
Mcu.IP8=SYS
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=TIM2
PD14.Signal=S_TIM4_CH3
Mcu.Pin28=PA12
Mcu.IP6=RCC
Mcu.Pin29=PA13 (JTMS/SWDIO)
Mcu.IP7=SPI2
ProjectManager.CoupleFile=true
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=480000000
Mcu.Pin22=PB15
RCC.I2C123Freq_Value=120000000
Mcu.Pin23=PD11
PA1.Locked=true
Mcu.Pin20=PB13
PD12.Mode=Single Bank 1
Mcu.Pin21=PB14
PA12.Mode=Device_Only
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
TIM5.Prescaler=26
PD11.Signal=QUADSPI_BK1_IO0
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
CRC.DefaultInitValueUse=DEFAULT_INIT_VALUE_DISABLE
PB2.Mode=Single Bank 1
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_OTG_FS_DM
TIM5.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
ProjectManager.HeapSize=0x800
Mcu.Pin15=PB0
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PB2
Mcu.Pin13=PA6
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
Mcu.Pin14=PA7
PD11.Mode=Single Bank 1
Mcu.Pin19=PB12
SH.S_TIM3_CH1.ConfNb=1
RCC.LPTIM345Freq_Value=120000000
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB10
Mcu.Pin18=PB11
VP_TIM4_VS_ClockSourceINT.Mode=Internal
FREERTOS.Mutexes01=portRawDataMutex,Dynamic,NULL
RCC.LTDCFreq_Value=480000000
RCC.SAI4AFreq_Value=480000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA4
TIM3.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
Mcu.Pin12=PA5
Mcu.Pin10=PA3
RCC.DIVQ1Freq_Value=480000000
PE2.Locked=true
TIM2.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_DISABLE
RCC.D3PPRE=RCC_APB4_DIV2
TIM5.Period=44443
SPI2.DataSize=SPI_DATASIZE_8BIT
RCC.HCLK3ClockFreq_Value=240000000
NVIC.TIM4_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.VCOInput2Freq_Value=800000
RCC.APB1Freq_Value=120000000
VP_CRC_VS_CRC.Mode=CRC_Activate
PB0.Signal=S_TIM3_CH3
PC0.Locked=true
ProjectManager.DeviceId=STM32H750VBTx
PC1.Signal=GPIO_Output
PB12.Signal=SPI2_NSS
ProjectManager.LibraryCopy=0
SH.S_TIM5_CH1.ConfNb=1
PA13\ (JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
CRC.CRCLength=CRC_POLYLENGTH_16B
PA7.Signal=S_TIM3_CH2
